# Задача 1_3 курса "Основы языка Python"

num = input("Введите число: ")
print(int(num + num + num) + int(num + num) + int(num))
